Tekla Open API Reference for Tekla Structures 2025
AnalysisModelAnalysisProperties Properties
The AnalysisModelAnalysisProperties type exposes the following members.
Properties
Name | Description
AccuracyOfIterations
 The accuracy of the iterations.
AnalysisMethod
 The analysis method.
MaxIterations
 The maximum number of iterations.
Top
See Also
Reference
AnalysisModelAnalysisProperties Class
Tekla.Structures.Analysis Namespace